lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/audio/fsl_adapter_audio.h
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef __HAL_AUDIO_ADAPTER_H__
#define __HAL_AUDIO_ADAPTER_H__

#include "fsl_common.h"

/*!
 * @addtogroup Audio_Adapter
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#if defined(SAI_XFER_QUEUE_SIZE)
#define HAL_AUDIO_QUEUE_SIZE ((uint32_t)SAI_XFER_QUEUE_SIZE)
#elif defined(I2S_NUM_BUFFERS)
#define HAL_AUDIO_QUEUE_SIZE ((uint32_t)I2S_NUM_BUFFERS)
#else
#define HAL_AUDIO_QUEUE_SIZE (4U)
#endif

#ifndef HAL_AUDIO_DMA_INIT_ENABLE
#define HAL_AUDIO_DMA_INIT_ENABLE (1U)
#endif /* HAL_AUDIO_DMA_INIT_ENABLE */

#if defined(__GIC_PRIO_BITS)
#ifndef HAL_AUDIO_ISR_PRIORITY
#define HAL_AUDIO_ISR_PRIORITY (25U)
#endif /* HAL_AUDIO_ISR_PRIORITY */
#else  /* __GIC_PRIO_BITS */
#if defined(configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY)
#ifndef HAL_AUDIO_ISR_PRIORITY
#define HAL_AUDIO_ISR_PRIORITY (configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY)
#endif /* HAL_AUDIO_ISR_PRIORITY */
#else
/* The default value 3 is used to support different ARM Core, such as CM0P, CM4, CM7, and CM33, etc.
 * The minimum number of priority bits implemented in the NVIC is 2 on these SOCs. The value of mininum
 * priority is 3 (2^2 - 1). So, the default value is 3.
 */
#ifndef HAL_AUDIO_ISR_PRIORITY
#define HAL_AUDIO_ISR_PRIORITY (3U)
#endif /* HAL_AUDIO_ISR_PRIORITY */
#endif /* configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY */
#endif /* __GIC_PRIO_BITS */

#if (defined(FSL_FEATURE_SOC_FLEXCOMM_COUNT) && (FSL_FEATURE_SOC_FLEXCOMM_COUNT > 0U)) && \
    (defined(FSL_FEATURE_SOC_I2S_COUNT) && (FSL_FEATURE_SOC_I2S_COUNT > 0U))
#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && (FSL_FEATURE_SOC_DMA_COUNT > 0U))
#define HAL_AUDIO_I2S_DMA_HANDLE_SIZE (HAL_AUDIO_QUEUE_SIZE * 8U + 48U)
#define HAL_AUDIO_HANDLE_SIZE_TEMP    (HAL_AUDIO_I2S_DMA_HANDLE_SIZE + 12U)
#else
#error This SOC does not have DMA available!
#endif /* FSL_FEATURE_SOC_DMA_COUNT */

#elif (defined(FSL_FEATURE_SOC_I2S_COUNT) && (FSL_FEATURE_SOC_I2S_COUNT > 0U))
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && (FSL_FEATURE_SOC_EDMA_COUNT > 0U)) || \
    (defined(FSL_FEATURE_SOC_DMA4_COUNT) && (FSL_FEATURE_SOC_DMA4_COUNT > 0U))
#define HAL_AUDIO_SAI_EDMA_HANDLE_SIZE (HAL_AUDIO_QUEUE_SIZE * 44U + 92U)
#define HAL_AUDIO_HANDLE_SIZE_TEMP     (HAL_AUDIO_SAI_EDMA_HANDLE_SIZE + 16U)
#elif (defined(FSL_FEATURE_SOC_DMA_COUNT) && (FSL_FEATURE_SOC_DMA_COUNT > 0U))
#define HAL_AUDIO_SAI_DMA_HANDLE_SIZE (HAL_AUDIO_QUEUE_SIZE * 12U + 12U)
#define HAL_AUDIO_HANDLE_SIZE_TEMP    (HAL_AUDIO_SAI_DMA_HANDLE_SIZE + 16U)
#else
#error This SOC does not have DMA or EDMA available!
#endif /*FSL_FEATURE_SOC_EDMA_COUNT or FSL_FEATURE_SOC_DMA_COUNT */

#else  /* FSL_FEATURE_SOC_FLEXCOMM_COUNT && FSL_FEATURE_SOC_I2S_COUNT */
#endif /* FSL_FEATURE_SOC_FLEXCOMM_COUNT && FSL_FEATURE_SOC_I2S_COUNT */

/*! @brief Definition of audio adapter handle size. */
#define HAL_AUDIO_HANDLE_SIZE (HAL_AUDIO_HANDLE_SIZE_TEMP)

/*! @brief HAL Audio status. */
typedef enum _hal_AUDIO_status
{
    kStatus_HAL_AudioSuccess   = kStatus_Success,                      /*!< Successfully */
    kStatus_HAL_AudioError     = MAKE_STATUS(kStatusGroup_HAL_I2S, 1), /*!< Error occurs on HAL Audio */
    kStatus_HAL_AudioBusy      = MAKE_STATUS(kStatusGroup_HAL_I2S, 2), /*!< HAL Audio is busy with current transfer */
    kStatus_HAL_AudioIdle      = MAKE_STATUS(kStatusGroup_HAL_I2S, 3), /*!< HAL Audio transmitter is idle */
    kStatus_HAL_AudioQueueFull = MAKE_STATUS(kStatusGroup_HAL_I2S, 4), /*!< Transfer queue is full */
} hal_audio_status_t;

/*! @brief HAL Audio channel number */
typedef enum _hal_audio_channel
{
    kHAL_AudioMono      = 0x7FU, /*!< Only one channel on bus. */
    kHAL_AudioMonoRight = 0x0U,  /*!< Only Right channel have sound. */
    kHAL_AudioMonoLeft,          /*!< Only left channel have sound. */
    kHAL_AudioStereo,            /*!< Stereo sound. */
    kHAL_AudioStereo3Channel,    /*!< Stereo 3 channel sound. */
    kHAL_AudioStereo4Channel,    /*!< Stereo 4 channel sound. */
    kHAL_AudioStereo5Channel,    /*!< Stereo 5 channel sound. */
    kHAL_AudioStereo6Channel,    /*!< Stereo 6 channel sound. */
    kHAL_AudioStereo7Channel,    /*!< Stereo 7 channel sound. */
    kHAL_AudioStereo8Channel,    /*!< Stereo 8 channel sound. */
    kHAL_AudioStereo9Channel,    /*!< Stereo 9 channel sound. */
    kHAL_AudioStereo10Channel,   /*!< Stereo 10 channel sound. */
    kHAL_AudioStereo11Channel,   /*!< Stereo 11 channel sound. */
    kHAL_AudioStereo12Channel,   /*!< Stereo 12 channel sound. */
    kHAL_AudioStereo13Channel,   /*!< Stereo 13 channel sound. */
    kHAL_AudioStereo14Channel,   /*!< Stereo 14 channel sound. */
    kHAL_AudioStereo15Channel,   /*!< Stereo 15 channel sound. */
    kHAL_AudioStereo16Channel,   /*!< Stereo 16 channel sound. */
} hal_audio_channel_t;

/*! @brief HAL Audio sample rate */
typedef enum _hal_audio_sample_rate
{
    kHAL_AudioSampleRate8KHz    = 8000U,   /*!< Sample rate 8000 Hz */
    kHAL_AudioSampleRate11025Hz = 11025U,  /*!< Sample rate 11025 Hz */
    kHAL_AudioSampleRate12KHz   = 12000U,  /*!< Sample rate 12000 Hz */
    kHAL_AudioSampleRate16KHz   = 16000U,  /*!< Sample rate 16000 Hz */
    kHAL_AudioSampleRate22050Hz = 22050U,  /*!< Sample rate 22050 Hz */
    kHAL_AudioSampleRate24KHz   = 24000U,  /*!< Sample rate 24000 Hz */
    kHAL_AudioSampleRate32KHz   = 32000U,  /*!< Sample rate 32000 Hz */
    kHAL_AudioSampleRate44100Hz = 44100U,  /*!< Sample rate 44100 Hz */
    kHAL_AudioSampleRate48KHz   = 48000U,  /*!< Sample rate 48000 Hz */
    kHAL_AudioSampleRate96KHz   = 96000U,  /*!< Sample rate 96000 Hz */
    kHAL_AudioSampleRate192KHz  = 192000U, /*!< Sample rate 192000 Hz */
    kHAL_AudioSampleRate384KHz  = 384000U, /*!< Sample rate 384000 Hz */
} hal_audio_sample_rate_t;

/*! @brief HAL Audio bit width */
typedef enum _hal_audio_bit_width
{
    kHAL_AudioWordWidth8bits  = 8U,  /*!< Audio data width 8 bits */
    kHAL_AudioWordWidth16bits = 16U, /*!< Audio data width 16 bits */
    kHAL_AudioWordWidth24bits = 24U, /*!< Audio data width 24 bits */
    kHAL_AudioWordWidth32bits = 32U, /*!< Audio data width 32 bits */
} hal_audio_bit_width_t;

/*! @brief HAL Audio bit clock polarity */
typedef enum _hal_audio_bclk_polarity
{
    kHAL_AudioSampleOnFallingEdge = 0x00U, /*!< Data samples at the falling edge. */
    kHAL_AudioSampleOnRisingEdge,          /*!< Data samples at the rising edge. */
} hal_audio_bclk_polarity_t;

/*! @brief HAL Audio frame sync width */
typedef enum _hal_audio_frame_sync_width
{
    kHAL_AudioFrameSyncWidthOneBitClk = 0x00U, /*!< 1 bit clock frame sync len for DSP mode */
    kHAL_AudioFrameSyncWidthPerWordWidth,      /*!< Frame sync length decided by word width */
    kHAL_AudioFrameSyncWidthHalfFrame,         /*!< Frame sync length is half of frame length */
} hal_audio_frame_sync_width_t;

/*! @brief HAL Audio frame sync polarity */
typedef enum _hal_audio_frame_sync_polarity
{
    kHAL_AudioBeginAtRisingEdge = 0x00U, /*!< Frame sync begins at the rising edge. */
    kHAL_AudioBeginAtFallingEdge,        /*!< Frame sync begins at the falling edge. */
} hal_audio_frame_sync_polarity_t;

/*! @brief HAL Audio master or slave mode */
typedef enum _hal_audio_master_slave
{
    kHAL_AudioMaster = 0x0U,            /*!< Master mode include bclk and frame sync */
    kHAL_AudioSlave,                    /*!< Slave mode  include bclk and frame sync */
    kHAL_AudioBclkMasterFrameSyncSlave, /*!< BCLK in master mode, frame sync in slave mode */
    kHAL_AudioBclkSlaveFrameSyncMaster, /*!< BCLK in slave mode, frame sync in master mode */
} hal_audio_master_slave_t;

/*! @brief Synchronous or asynchronous mode, only for SAI configuration */
typedef enum _hal_audio_sai_sync_mode
{
    kHAL_AudioSaiModeAsync = 0x0U, /*!< Asynchronous mode */
    kHAL_AudioSaiModeSync,         /*!< Synchronous mode (with receiver or transmit) */
} hal_audio_sai_sync_mode_t;

/*! @brief HAL Audio data format */
typedef enum _hal_audio_data_format
{
    kHAL_AudioDataFormatI2sClassic = 0x0U, /*!< I2S classic mode */
    kHAL_AudioDataFormatLeftJustified,     /*!< Left-Justified mode */
    kHAL_AudioDataFormatRightJustified,    /*!< Right-Justified mode */
    kHAL_AudioDataFormatDspModeA,          /*!< DSP mode A, channel is available on 2nd rising edge of BCLK
                                                following a rising edge of frame sync */
    kHAL_AudioDataFormatDspModeB,          /*!< DSP mode B, channel is available on 1st rising edge of BCLK
                                                following a rising edge of frame sync */
} hal_audio_data_format_t;

